Revit 2024 API
CurveElementType Enumeration
 An enumerated type listing the curve element types that can be used when filtering elements (via CurveElementFilter).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public enum CurveElementType
Visual Basic
Public Enumeration CurveElementType
Visual C++
public enum class CurveElementType
Members
Member name | Description
Invalid |  An invalid curve element type.
ModelCurve |  A model curve.
DetailCurve |  A detail curve.
SymbolicCurve |  A symbolic curve.
ReferenceLine |  A reference line.
SpaceSeparation |  A space separation curve.
RoomSeparation |  An room separation curve.
AreaSeparation |  An area separation curve.
CurveByPoints |  A curve created by connecting a set of points.
RepeatingDetail |  The profile of a repeating detail set.
Insulation |  A detail curve representing insulation.
Cloud |  A portion of a revision cloud.
AreaBasedLoadBoundary |  An Area Based Load Boundary curve.
See Also
Autodesk.Revit.DB Namespace